function getRandomId() {
  return Math.random().toString(36).substring(2);
}
const pages = [
  {
    front: {
      title: "想象之中",
      text: "",
      lyric:
        "[00:00.000] 作词 : 许嵩\n[00:01.000] 作曲 : 许嵩\n[00:02.000] 编曲 : 蔡庭贵\n[00:03.000] 制作人 : 许嵩\n[00:20.506] 想象之中\n[00:22.098] 雨过一道彩虹\n[00:24.225] 抬起了头\n[00:26.349] 瑟瑟灰色天空\n[00:28.475] 想象之中\n[00:30.600] 付出会有结果\n[00:32.725] 毫无保留\n[00:34.319] 信奉你的承诺\n[00:37.505] 想象之中\n[00:39.099] 这次要爱很久\n[00:41.225] 我领略过\n[00:43.350] 你眼里的温柔\n[00:45.475] 热烈以后\n[00:47.599] 你忽然的冰冻\n[00:49.990] 判若两人\n[00:51.583] 丢给我去承受\n[00:57.103] 想象中 很不同\n[01:01.353] （想象中一切都和后来不同）\n[01:05.538] 我承认 曾经那么心动\n[01:11.915] 你没想象中那么恋旧\n[01:15.633] 回忆唤不回你的温柔\n[01:19.881] 最后也不是故作冷漠\n[01:24.132] 转过头我怎么有一滴泪落\n[01:28.383] 我没想象中那么脆弱\n[01:32.897] 分开后形容也没消瘦\n[01:37.147] 一起踏过了几座春秋\n[01:41.398] 领悟了爱不是追逐占有\n[02:05.232] 想象之中\n[02:07.023] 这次要爱很久\n[02:09.149] 我领略过\n[02:11.274] 你眼里的温柔\n[02:13.665] 热烈以后\n[02:15.790] 你忽然的冰冻\n[02:17.915] 判若两人\n[02:19.509] 丢给我去承受\n[02:23.692] 想象中 很不同\n[02:29.272] （想象中一切都和后来不同）\n[02:33.452] 我承认 曾经那么心动\n[02:39.561] 你没想象中那么恋旧\n[02:43.547] 回忆唤不回你的温柔\n[02:47.798] 最后也不是故作冷漠\n[02:52.049] 转过头我怎么有一滴泪落\n[02:56.297] 我没想象中那么脆弱\n[03:00.548] 分开后形容也没消瘦\n[03:05.062] 一起踏过了几座春秋\n[03:09.312] 领悟了爱不是追逐占有\n[03:16.217] 你没想象中那么恋旧\n[03:19.866] 回忆唤不回你的温柔\n[03:24.382] 最后也不是故作冷漠\n[03:28.632] 转过头 我怎么有一滴泪落\n[03:33.413] 我没想象中那么脆弱\n[03:37.663] 分开后形容也没消瘦\n[03:41.913] 一起踏过了几座春秋\n[03:46.165] 领悟了爱不是追逐占有\n",
      background: "https://i02piccdn.sogoucdn.com/65ffb1fe52e4b412",
      music: "./music/许嵩 - 想象之中.mp3",
      id: getRandomId(),
    },
    back: {
      title: "河山大好",
      text: "",
      lyric:
        "[00:00.000] 作词 : 许嵩\n[00:01.000] 作曲 : 许嵩\n[00:02.000] 编曲 : 吕绍淳\n[00:32.002] 最近亚健康状态\n[00:33.798] 坐久了腿发软\n[00:34.856] 电脑看久了脖子它也会酸\n[00:37.519] 数字时代貌似把生活节奏加快\n[00:39.902] 也让人变得行动迟缓\n[00:42.033] 忙忙忙\n[00:43.889] 忙出个什么所以然\n[00:45.485] 地球离了谁它都照样公转自转\n[00:48.140] 叹叹叹\n[00:48.937] 弹指一挥人生苦短\n[00:50.795] 终点不明沿途风景要好好看\n[00:53.457] 你可以隐隐期待\n[00:54.780] 途中佳缘到来\n[00:56.046] 保持浪漫心态\n[00:57.640] 活着就不算坏\n[00:58.700] 家国大好河山\n[01:00.035] 不必崇洋媚外\n[01:01.356] 好地方一生都看不完\n[01:04.021] 峨眉山庐山黄山嵩山\n[01:06.938] 抓紧周末带爸爸妈妈去转一转\n[01:09.593] 北京西安洛阳开封安阳南京杭州\n[01:11.983] 睹一睹古都的风采\n[01:14.912] 心情大好\n[01:16.234] 出去走走\n[01:17.566] 碧海蓝天吹吹风\n[01:20.221] 河山大好\n[01:21.552] 出去走走\n[01:22.877] 别窝在家当懒虫\n[01:25.530] 心情大好\n[01:26.862] 出去走走\n[01:28.194] 碧海蓝天吹吹风\n[01:30.851] 河山大好\n[01:32.172] 出去走走\n[01:33.505] 别窝在家当懒虫\n[01:46.759] 忙忙忙忙忙忙……\n[01:50.747] 忙出个什么所以然\n[01:52.280] 叹叹叹\n[01:53.078] 弹指一挥人生苦短\n[01:54.676] 终点不明沿途风景要好好看\n[01:57.603] 你可以隐隐期待\n[01:58.660] 途中佳缘到来\n[01:59.992] 保持浪漫心态\n[02:01.578] 活着就不算坏\n[02:02.908] 家国大好河山\n[02:03.971] 不必崇洋媚外\n[02:05.303] 好地方一生都看不完\n[02:07.958] 峨眉山庐山黄山嵩山\n[02:10.613] 抓紧周末带爸爸妈妈去转一转\n[02:13.276] 北京西安洛阳开封安阳南京杭州\n[02:16.191] 睹一睹古都的风采\n[02:21.365] 心情大好\n[02:22.688] 出去走走\n[02:24.019] 碧海蓝天吹吹风\n[02:26.414] 河山大好\n[02:28.006] 出去走走\n[02:29.330] 别窝在家当懒虫\n[02:31.920] 心情大好\n[02:33.516] 出去走走\n[02:34.841] 碧海蓝天吹吹风\n[02:37.501] 河山大好\n[02:38.824] 出去走走\n[02:40.157] 别窝在家当懒虫\n[02:53.443] 心情大好河山大好\n[02:59.022] 心情大好河山大好\n[03:01.548] 别窝在家当懒虫\n[03:04.260] 心情大好\n[03:05.331] 出去走走\n[03:06.916] 碧海蓝天吹吹风\n[03:09.306] 河山大好\n[03:10.901] 出去走走\n[03:12.183] 只不过是河山大好\n",
      background: "https://i04piccdn.sogoucdn.com/c78da20b330e8697",
      music: "./music/许嵩 - 河山大好.mp3",
      id: getRandomId(),
    },
  },
  {
    front: {
      title: "拆东墙",
      text: "",
      lyric:
        "[00:00.000] 作词 : 许嵩\n[00:01.000] 作曲 : 许嵩\n[00:02.000] 编曲 : 洪敬尧\n[00:27.631] 公元六五九年 十九岁 他接他爹的班\n[00:31.906] 考不取功名的后果是接手自家酒馆\n[00:36.430] 又听说同乡谁已经赴京做上小官\n[00:39.884] 他的梦 往来客谁能买单\n[00:45.727] 代代叹世道难人心乱 可又能怎么办\n[00:49.977] 他女人的美丽对比映衬出他的难看\n[00:54.486] 朋友说 她不爱 没有爱 只是贪他小财\n[01:00.593] 可他爱 连菜都自己去买\n[01:08.568] 掌柜的小破酒馆被人拆了东墙\n[01:12.222] 后来衙门说按一平米八吊钱来跟他折算\n[01:17.268] 他不干 他不干 百年招牌祖祖辈辈流传下来\n[01:21.780] 挣的并不快 但人熟地熟 还算落个自在\n[01:26.292] 掌柜的小破酒馆被人拆了东墙\n[01:30.279] 后来有人看见他冒雪背着行囊暗夜离开\n[01:35.327] 丢下老 丢下少 他是否也曾无奈\n[01:39.314] 一去若回来\n[01:41.912] 老家的酒香还在不在\n[02:02.298] 代代叹世道难人心乱 可又能怎么办\n[02:07.268] 他女人的美丽对比映衬出他的难看\n[02:11.520] 朋友说 她不爱 没有爱 只是贪他小财\n[02:17.363] 可他爱 连菜都自己去买\n[02:25.065] 掌柜的小破酒馆被人拆了东墙\n[02:29.051] 后来衙门说按一平米八吊钱来跟他折算\n[02:34.361] 他不干 他不干 百年招牌祖祖辈辈流传下来\n[02:38.884] 挣的并不快 但人熟地熟 还算落个自在\n[02:43.132] 掌柜的小破酒馆被人拆了东墙\n[02:47.110] 后来有人看见他冒雪背着行囊暗夜离开\n[02:52.429] 丢下老 丢下少 他是否也曾无奈\n[02:56.415] 一去若回来\n[02:58.480] 老家的酒香还在不在\n[03:19.210] 掌柜的小破酒馆被人拆了东墙\n[03:23.393] 后来衙门说按一平米八吊钱来跟他折算\n[03:28.439] 他不干 他不干 百年招牌祖祖辈辈流传下来\n[03:32.951] 挣的并不快 但人熟地熟 还算落个自在\n[03:37.473] 掌柜的小破酒馆被人拆干净了\n[03:41.460] 后来有人说那夜他被揍到走路一瘸一拐\n[03:46.771] 兴也苦 亡也苦 青史总让人无奈\n[03:50.756] 更迭了朝代 当时的明月换拨人看\n[03:59.778] 西墙补不来\n[04:02.159] 可东墙面子上还得拆\n",
      background: "https://i02piccdn.sogoucdn.com/e68f0ed164be83ea",
      music: "./music/许嵩 - 拆东墙.mp3",
      id: getRandomId(),
    },
    back: {
      title: "医生",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:00.00] 作曲 : 许嵩\n[00:00.00] 编曲 : 吕绍淳\n[00:00.00]医生 - 许嵩 (Vae Xu)\n[00:05.14]词：许嵩\n[00:10.28]曲：许嵩\n[00:15.43]你说懂了爱不是浪漫\n[00:20.21]\n[00:22.87]我的本分给你安全感\n[00:27.71]\n[00:28.48]是他让你受了内伤\n[00:32.55]我努力恢复你健康\n[00:36.13]我也没那种庸俗的情结\n[00:42.44]\n[00:44.70]可他还是在你心里边\n[00:49.25]\n[00:51.70]偶尔梦中还窜到嘴边\n[00:56.49]\n[00:57.56]其实我也能够了解\n[01:01.29]心碎一旦到过极限\n[01:05.16]用多少岁月 都愈合不完全\n[01:11.46]\n[01:12.09]我是你无奈的选择\n[01:14.98]\n[01:15.62]你只想跟一个好人\n[01:18.65]\n[01:19.33]我为你戴上了戒指\n[01:21.70]\n[01:22.87]你的笑也还算逼真\n[01:25.83]\n[01:26.59]我是你无奈的选择\n[01:29.51]\n[01:30.18]却不是多么爱的人\n[01:33.78]只怪他下手太残忍\n[01:36.19]\n[01:37.09]改变你一生\n[01:41.10]\n[01:53.79]你说懂了爱不是浪漫\n[01:58.08]\n[02:01.00]我的本分给你安全感\n[02:05.22]\n[02:06.66]是他让你受了内伤\n[02:10.16]\n[02:10.69]我努力恢复你健康\n[02:14.27]我也没那种庸俗的情结wu\n[02:22.52]可他还是在你心里边\n[02:29.71]偶尔梦中还窜到嘴边\n[02:35.68]其实我也能够了解\n[02:39.49]心碎一旦到过极限\n[02:43.04]用多少岁月 都愈合不完全\n[02:49.22]\n[02:50.32]我是你无奈的选择\n[02:53.61]你只想跟一个好人\n[02:56.67]\n[02:57.43]我为你戴上了戒指\n[03:00.40]\n[03:00.99]你的笑也还算逼真\n[03:03.87]\n[03:04.74]我是你无奈的选择\n[03:07.65]\n[03:08.29]却不是多么爱的人\n[03:11.25]\n[03:11.95]只怪他下手太残忍\n[03:14.32]\n[03:15.37]改变你一生\n[03:19.53]我是你无奈的选择\n[03:22.24]\n[03:22.88]你只想跟一个好人\n[03:25.83]\n[03:26.60]我为你戴上了戒指\n[03:29.41]\n[03:30.13]你的笑\n[03:31.12]也还算是那么逼真\n[03:34.10]我是你无奈的选择\n[03:36.71]\n[03:37.46]却不是多么爱的人\n[03:40.18]\n[03:41.06]只怪他下手太残忍\n[03:43.82]\n[03:44.72]改变你一生\n",
      background: "https://i03piccdn.sogoucdn.com/240efbd87b1316a3",
      music: "./music/许嵩 - 医生.mp3",
      id: getRandomId(),
    },
  },
  {
    front: {
      title: "微博控",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 覃桢\n[00:30.20]你的昵称实在够土很多人用过\n[00:33.57]Lucy不寂寞 Fancy有一坨\n[00:36.95]你的头像和你够像但不够诱惑\n[00:40.39]见过本尊的只有我\n[00:44.24]你关注的人里面有七个非常火\n[00:47.36]全部是男的 我也有点火\n[00:50.68]你最Happy的是看到粉丝数增多\n[00:54.24]其实全是我的弟兄\n[00:57.68]只是喝一碗杨枝甘露 你掏出手机拍个不休\n[01:04.36]把我晾在一旁像一块木头 让我感觉有点寂寞\n[01:12.99]你是可以什么都不做\n[01:16.30]但不可以什么都不说\n[01:19.96]你又登陆了你微博\n[01:21.90]分享直播你的生活\n[01:26.71]我是可以什么都不说\n[01:30.14]但不可以什么都不做\n[01:33.83]放下客户端立地成佛\n[01:53.62]你的昵称实在够土很多人用过\n[01:56.99]Lucy不寂寞 Fancy有一坨\n[02:00.55]你的头像和你够像但不够诱惑\n[02:03.93]见过本尊的只有我\n[02:07.18]你关注的人里面有七个非常火\n[02:10.42]全部是男的 我也有点火\n[02:14.11]你最Happy的是看到粉丝数增多\n[02:17.61]其实全是我的弟兄\n[02:21.36]只有一碗杨枝甘露 你掏出手机拍个不休\n[02:27.56]把我晾在一旁像一块木头 让我感觉有点寂寞\n[02:36.13]你是可以什么都不做\n[02:39.88]但不可以什么都不说\n[02:43.47]你又登录了你微博\n[02:45.22]分享直播你的生活\n[02:50.50]我是可以什么都不说\n[02:53.69]但不可以什么都不做\n[02:57.32]放下客户端立地成佛\n[03:02.82]你是可以什么都不做\n[03:05.75]但不可以什么都不说\n[03:09.32]你又登陆了你微博\n[03:11.25]分享直播你的生活\n[03:16.13]我是可以什么都不说\n[03:19.88]但不可以什么都不做\n[03:23.50]放下客户端立地成佛\n[03:30.87]我不想再转你的微博\n",
      background: "https://i03piccdn.sogoucdn.com/72264c5c526465b9",
      music: "./music/许嵩 - 微博控.mp3",
      id: getRandomId(),
    },
    back: {
      title: "毁人不倦",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 许嵩\n[00:05.00]几片 来自松岛的枫叶\n[00:09.22]堆叠 魅惑血红的感觉\n[00:13.28]少年 从这里开始新的体验\n[00:17.05]最后 造了孽\n[00:21.97]一月 当半数生命终结\n[00:25.79]付钱 付到忏悔的境界\n[00:30.21]蜕变 洒下了一滩碎片\n[00:33.92]它毁人不倦\n[00:37.58]初夏的雨点 落得太敷衍\n[00:41.65]习惯了随随便便\n[00:45.45]被放任的夜 被放任的苟且\n[00:50.03]都怪它怂恿了拉链\n[00:54.46]初夏的雨点 落得太敷衍\n[00:58.47]习惯了不辞而别\n[01:02.43]激情已退却\n[01:04.37]她也不再呜咽\n[01:06.81]体谅了爱情的肤浅\n[01:29.28]一月 当半数生命终结\n[01:33.29]付钱 付到忏悔的境界\n[01:37.56]蜕变 洒下了一滩碎片\n[01:41.37]它毁人不倦\n[01:45.08]初夏的雨点 落得太敷衍\n[01:49.04]习惯了随随便便\n[01:53.10]被放任的夜 被放任的苟且\n[01:57.42]都怪它怂恿了拉链\n[02:01.84]初夏的雨点 落得太敷衍\n[02:06.11]习惯了不辞而别\n[02:09.61]激情已退却\n[02:11.65]她也不再呜咽\n[02:14.14]体谅了爱情的肤浅\n[02:23.18]初夏的雨点 落得太敷衍\n[02:27.76]习惯了随随便便\n[02:30.51]被放任的夜 被放任的苟且\n[02:35.30]都怪它怂恿了拉链\n[02:39.67]初夏的雨点 落得太敷衍\n[02:43.78]习惯了不辞而别\n[02:47.24]激情已退却\n[02:49.27]她也不再呜咽\n[02:52.27]体谅了爱情的肤浅\n[02:56.74]原谅这时代的肤浅\n",
      background: "https://i03piccdn.sogoucdn.com/18c3a69713b489b8",
      music: "./music/许嵩 - 毁人不倦.mp3",
      id: getRandomId(),
    },
  },
  {
    front: {
      title: "双人旁",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 杨阳\n[00:03.00] 制作人 : 许嵩\n[00:21.46]当你坐在我身旁\n[00:27.61]梨花带雨的模样\n[00:31.09]电影情节有点伤\n[00:34.57]把你的柔弱释放\n[00:38.25]当我坐在你身旁\n[00:41.68]悬的手就会紧张\n[00:45.17]往哪儿放\n[00:47.28]值得再三思量\n[00:52.28]你提过的好地方\n[00:56.33]我标在地图上\n[00:59.61]等哪一天\n[01:01.32]我带你去流浪 流浪\n[01:09.61]我身旁 还漂浮你发香\n[01:16.27]你身旁 环绕我的期望\n[01:23.58]我们俩 也许曾经都受过\n[01:29.24]伤\n[01:32.47]相似的风雨后 有不同的\n[01:36.45]敞亮\n[01:40.84]\n[01:54.32]当我坐在你身旁\n[01:57.55]悬的手就会紧张\n[02:01.13]往哪儿放\n[02:02.80]值得再三思量\n[02:07.89]你提过的好地方\n[02:12.02]我标在地图上\n[02:15.41]等哪一天\n[02:17.22]我带你去流浪 流浪\n[02:25.41]我身旁 还漂浮你发香\n[02:32.42]你身旁 环绕我的期望\n[02:39.44]我们俩 也许曾经都受过\n[02:45.24]伤\n[02:48.38]相似的风雨后 有不同的\n[02:52.27]敞亮\n[02:55.54]我身旁 还漂浮你发香\n[03:02.46]你身旁 环绕我的期望\n[03:09.13]我们俩 也许曾经都受过\n[03:14.63]伤\n[03:18.36]相似的风雨后 有不同的\n[03:21.85]敞亮\n",
      background: "https://i04piccdn.sogoucdn.com/bada37b9f7acf4e0",
      music: "./music/许嵩 - 双人旁.mp3",
      id: getRandomId(),
    },
    back: {
      title: "降温",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 许环良\n[00:03.00] 制作人 : 许环良\n[00:14.64]11月20日0点\n[00:16.02]北京 小雨\n[00:16.73]心情 好平静\n[00:21.30]今天做了很多事情\n[00:23.13]回到家里有点烦心\n[00:24.76]接到她的电话\n[00:26.23]我都没有使用好的语气\n[00:28.92]Sorry 那不是我本意\n[00:31.01]也不知道我最近是怎么搞的\n[00:33.55]也许被那几只狗气的\n[00:36.34]Sat Sun 没有时间考虑考虑休息\n[00:39.29]它们等着我混音\n[00:40.76]今日消费是281人民币\n[00:51.29]落地窗上好像已经蒙上厚厚的雾气\n[00:54.95]刚倒的一杯热水 凉了 像极了我和你\n[00:58.61]天地虽然好冷 但房里没有开暖气\n[01:02.07]要顺应自然规律 就像当时我放开你\n[01:06.28]我调整心态 呼吸节奏渐渐的平缓\n[01:12.48]把电视打开 节目和嘉宾全在瞎侃\n[01:21.33]短信快存满 假意or真情 自知冷暖\n[01:28.70]楼上女人哭喊 夫妻吵架没有人管\n[01:51.37]最惨的事 不是忘不了悲伤的回忆\n[01:54.62]而是 那些悲伤的 却已经开始记不起\n[01:58.60]我渐渐丢失全部的线索所有的证据\n[02:02.15]但我还记得我爱过你 所以我要谢谢你\n[02:06.27]我调整心态 呼吸节奏渐渐的平缓\n[02:14.00]把电视打开 节目和嘉宾还在瞎侃\n[02:21.37]短信快存满 假意or真情 自知冷暖\n[02:28.84]楼上女人哭喊 夫妻吵架没有人管\n[02:36.92]\n[02:51.57]我不相信爱 目前非常缺乏安全感\n[02:58.83]蜷缩的心态 需要用一段时间舒展\n[03:06.36]他们说的爱 如果有 我就为它平反\n[03:13.42]江上两条红船 寒风斜雨中你摇摆\n",
      background: "https://i02piccdn.sogoucdn.com/842ecb128a485262",
      music: "./music/许嵩 - 降温.mp3",
      id: getRandomId(),
    },
  },
  {
    front: {
      title: "敬酒不吃",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 蔡庭贵\n[00:13.46]\n[00:17.95]有些人一吃饭就很喜欢敬酒\n[00:25.07]三杯酒下肚就能够唤你朋友\n[00:34.91]半醉不醉后他说出一个请求\n[00:42.85]就是 哈啊嗯缓缓开口\n[00:53.04]想让我喝酒要问真心够不够\n[01:01.72]令母毕生遗憾想必是儿子丑\n[01:10.35]看你不顺眼自然有我的理由\n[01:18.07]请你当面抽 别在背后\n[01:27.40]敬酒不吃吃罚酒的伤\n[01:30.87]我一个人品尝\n[01:35.26]你心里定在骂我轻狂\n[01:39.04]但能把我怎样\n[01:44.64]身在高楼心在北大荒\n[01:47.88]我就这副死样\n[01:52.32]何必跟我装\n[01:56.55]没用场\n[02:10.98]敬酒不吃吃什么酒\n[02:22.08]想让我喝酒要问真心够不够\n[02:30.81]令母毕生遗憾想必是儿子丑\n[02:39.94]看你不顺眼自然有我的理由\n[02:47.56]请你当面抽 别在背后\n[02:56.80]敬酒不吃吃罚酒的伤\n[02:59.77]我一个人品尝\n[03:05.47]你心里定在骂我轻狂\n[03:08.55]但能把我怎样\n[03:14.10]身在高楼心在北大荒\n[03:17.28]我就这副死样\n[03:21.82]何必跟我装\n[03:25.75]没用场\n[03:31.80]敬酒不吃吃什么酒\n[03:36.29]\n[03:40.37]敬酒不吃吃什么酒\n[03:49.09]敬酒不吃吃什么酒\n[04:11.09]敬酒不吃吃罚酒的伤\n[04:14.02]我一个人品尝\n[04:19.47]你心里定在骂我轻狂\n[04:22.59]但能把我怎样\n[04:28.29]身在高楼心在北大荒\n[04:31.31]我就这副死样\n[04:36.72]何必跟我装\n[04:40.10]没用场\n",
      background: "https://i01piccdn.sogoucdn.com/6dcace7feb4a2ca9",
      music: "./music/许嵩 - 敬酒不吃.mp3",
      id: getRandomId(),
    },
    back: {
      title: "千百度",
      text: "",
      lyric:
        "[00:00.00] 作词 : 许嵩\n[00:01.00] 作曲 : 许嵩\n[00:02.00] 编曲 : 杨阳\n[00:37.60]关外野店 烟火绝 客怎眠\n[00:41.66]\n[00:42.78]寒来袖间 谁为我 添两件\n[00:47.58]\n[00:48.52]三四更雪 风不减 吹袭一夜\n[00:54.07]只是可怜 瘦马未得好歇\n[00:58.57]\n[00:59.82]怅然入梦 梦几月 醒几年\n[01:04.31]\n[01:05.31]往事凄艳 用情浅 两手缘\n[01:09.80]\n[01:10.80]鹧鸪清怨 听得见 飞不回堂前\n[01:16.62]\n[01:17.30]旧楹联红褪墨残谁来揭\n[01:21.11]\n[01:24.91]我寻你千百度 日出到迟暮\n[01:30.84]一瓢江湖我沉浮\n[01:35.02]\n[01:35.89]我寻你千百度 又一岁荣枯\n[01:42.53]可你从不在 灯火阑珊处\n[01:46.09]\n[02:09.67]怅然入梦 梦几月 醒几年\n[02:14.04]\n[02:14.91]往事凄艳 用情浅 两手缘\n[02:19.53]\n[02:20.91]鹧鸪清怨 听得见 飞不回堂前\n[02:26.83]旧楹联红褪墨残谁来揭\n[02:30.83]\n[02:34.69]我寻你千百度 日出到迟暮\n[02:40.87]一瓢江湖我沉浮\n[02:44.87]\n[02:45.68]我寻你千百度 又一岁荣枯\n[02:51.79]\n[02:52.68]可你从不在 灯火阑珊处\n[02:55.98]\n[02:57.17]我寻你千百度 日出到迟暮\n[03:03.10]一瓢江湖我沉浮\n[03:06.84]\n[03:08.03]我寻你千百度 又一岁荣枯\n[03:13.63]\n[03:18.30]你不在 灯火阑珊处\n",
      background: "https://i02piccdn.sogoucdn.com/d4f6e7746cc1c641",
      music: "./music/许嵩 - 千百度.mp3",
      id: getRandomId(),
    },
  },
];

const menuList = [];
pages.forEach((item) => {
  if (item.front.title) {
    menuList.push({
      title: item.front.title,
      id: item.front.id,
    });
  }
  if (item.back.title) {
    menuList.push({
      title: item.back.title,
      id: item.back.id,
    });
  }
});

const covers = [
  {
    front: {
      title: "『苏格兰没有底』",
      background:
        "https://p1.music.126.net/Vq7nvSxE1dD6zP6_uLK9tw==/109951169976864294.jpg",
      id: getRandomId(),
    },
    back: {
      menu: menuList,
      background:
        "https://p1.music.126.net/Vq7nvSxE1dD6zP6_uLK9tw==/109951169976864294.jpg",
      id: getRandomId(),
    },
  },
  {
    front: {},
    back: {
      title: "",
      background:
        "https://p1.music.126.net/Vq7nvSxE1dD6zP6_uLK9tw==/109951169976864294.jpg",
      id: getRandomId(),
    },
  },
];
